++++++++++++++++++++++++++++++++++++++++
terraform -v
Terraform v0.13.1
+ provider registry.terraform.io/hashicorp/oci v3.90.1
++++++++++++++++++++++++++++++++++++++++
========================================
terraform init -var-file="phx_l.tfvars"
Initializing modules...
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for ads...
- ads in .terraform/modules/ads/common/availability_domains
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for compartments...
- compartments in .terraform/modules/compartments/compartments
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for compartments_environment...
- compartments_environment in .terraform/modules/compartments_environment/compartments
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for compartments_network...
- compartments_network in .terraform/modules/compartments_network/compartments
- export in ../tf_module_storage/fss/export
- export_set in ../tf_module_storage/fss/export_set
- fss in ../tf_module_storage/fss/fss
- mount_target in ../tf_module_storage/fss/mount_target
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for nsgs...
- nsgs in .terraform/modules/nsgs/networking/nsg
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for subnets...
- subnets in .terraform/modules/subnets/networking/subnet
Downloading git::https://xxxx.net/oci/otac_tee_iaac/tf_modules/tf_module_datasource.git for vcns...
- vcns in .terraform/modules/vcns/networking/vcn

Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/oci versions matching ">= 3.0.0"...
- Installing hashicorp/oci v3.90.1...
- Installed hashicorp/oci v3.90.1 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.
========================================================

kumvinov-mac:tf_tee_storage-tf-0.13.0 kumvinov$ terraform apply -var-file="phx_l.tfvars"
module.ads.data.oci_identity_availability_domains.ads: Refreshing state...
module.compartments.data.oci_identity_compartments.compartments: Refreshing state...
module.compartments_network.data.oci_identity_compartments.compartments: Refreshing state...
module.compartments_environment.data.oci_identity_compartments.compartments: Refreshing state...
module.vcns.data.oci_core_vcns.vcns: Refreshing state...
module.nsgs.data.oci_core_network_security_groups.nsgs: Refreshing state...
module.subnets.data.oci_core_subnets.subnets: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.oci_file_storage_export_sets.export_sets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_export_sets" "export_sets"  {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaaarka"
      + export_sets         = (known after apply)
    }

  # data.oci_file_storage_file_systems.fss will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_file_systems" "fss"  {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaamnbka"
      + file_systems        = (known after apply)
    }

  # data.oci_file_storage_mount_targets.mount_targets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_mount_targets" "mount_targets"  {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaaanbka"
      + mount_targets       = (known after apply)
    }

  # module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0] will be created
  + resource "oci_file_storage_export" "export" {
      + export_set_id  = (known after apply)
      + file_system_id = (known after apply)
      + id             = (known after apply)
      + path           = "/phxl1-dbbackend-001"
      + state          = (known after apply)
      + time_created   = (known after apply)

      + export_options {
          + access                         = "READ_WRITE"
          + anonymous_gid                  = "65534"
          + anonymous_uid                  = "65534"
          + identity_squash                = "NONE"
          + require_privileged_source_port = false
          + source                         = "10.152.104.0/24"
        }
    }

  # module.export_set["phxl1-dbbackend-001"].oci_file_storage_export_set.export_set[0] will be created
  + resource "oci_file_storage_export_set" "export_set" {
      + availability_domain = (known after apply)
      + compartment_id      = (known after apply)
      + display_name        = "phxl1-dbbackend-001"
      + id                  = (known after apply)
      + max_fs_stat_bytes   = "23843202333"
      + max_fs_stat_files   = "223442"
      + mount_target_id     = (known after apply)
      + state               = (known after apply)
      + time_created        = (known after apply)
      + vcn_id              = (known after apply)
    }

  # module.fss["phxl1-filesystem-dbbackend-001"].oci_file_storage_file_system.fss[0] will be created
  + resource "oci_file_storage_file_system" "fss" {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaa4qdbue2mnbka"
      + defined_tags        = (known after apply)
      + display_name        = "phxl1-filesystem-dbbackend-001"
      + freeform_tags       = {
          + "Environment"     = "Lab"
          + "Purpose"         = "Terraform"
          + "Region_function" = "Primary"
        }
      + id                  = (known after apply)
      + metered_bytes       = (known after apply)
      + state               = (known after apply)
      + time_created        = (known after apply)
    }

  # module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0] will be created
  + resource "oci_file_storage_mount_target" "mount_target" {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaamnbka"
      + defined_tags        = (known after apply)
      + display_name        = "phxl1-mount_target-control-001"
      + export_set_id       = (known after apply)
      + freeform_tags       = {
          + "Environment"     = "Lab"
          + "Purpose"         = "Terraform"
          + "Region_function" = "Primary"
        }
      + id                  = (known after apply)
      + ip_address          = "10.152.104.251"
      + lifecycle_details   = (known after apply)
      + nsg_ids             = [
          + "ocid1.networksecuritygroup.oc1.phxszvj3p6pxa",
        ]
      + private_ip_ids      = (known after apply)
      + state               = (known after apply)
      + subnet_id           = "ocid1.subnet.oc1.phx.aaa4zqv5voz4jwithtrksta"
      + time_created        = (known after apply)
    }

  # module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0] will be created
  + resource "oci_file_storage_mount_target" "mount_target" {
      + availability_domain = "WrnJ:PHX-AD-1"
      + compartment_id      = "ocid1.compartment.oc1..aaaaaaamnbka"
      + defined_tags        = (known after apply)
      + display_name        = "phxl1-mount_target-data-001"
      + export_set_id       = (known after apply)
      + freeform_tags       = {
          + "Environment"     = "Lab"
          + "Purpose"         = "Terraform"
          + "Region_function" = "Primary"
        }
      + id                  = (known after apply)
      + ip_address          = "10.xxx.32.251"
      + lifecycle_details   = (known after apply)
      + nsg_ids             = [
          + "ocid1.networksecuritygroup.oc1.phx.aaaaaaxa",
        ]
      + private_ip_ids      = (known after apply)
      + state               = (known after apply)
      + subnet_id           = "ocid1.subnet.oc1.phx.aaaaagq"
      + time_created        = (known after apply)
    }

Plan: 5 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

module.fss["phxl1-filesystem-dbbackend-001"].oci_file_storage_file_system.fss[0]: Creating...
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Creating...
module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0]: Creating...
module.fss["phxl1-filesystem-dbbackend-001"].oci_file_storage_file_system.fss[0]: Creation complete after 4s [id=ocid1.filesystem.oc1.phx.aaaaaaaaaaa]
data.oci_file_storage_file_systems.fss: Reading...
data.oci_file_storage_file_systems.fss: Read complete after 1s [id=2020-09-02 11:01:34.804899 +0000 UTC]
module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0]: Still creating... [10s elapsed]
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Still creating... [10s elapsed]
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Still creating... [20s elapsed]
module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0]: Still creating... [20s elapsed]
module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0]: Creation complete after 23s [id=ocid1.mounttarget.oc1.aa]
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Still creating... [30s elapsed]
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Creation complete after 40s [id=ocid1.mounttarget.oc1.phx.aaaaaaaa]
data.oci_file_storage_mount_targets.mount_targets: Reading...
data.oci_file_storage_mount_targets.mount_targets: Read complete after 0s [id=2020-09-02 11:02:10.191313 +0000 UTC]
module.export_set["phxl1-dbbackend-001"].oci_file_storage_export_set.export_set[0]: Creating...
module.export_set["phxl1-dbbackend-001"].oci_file_storage_export_set.export_set[0]: Creation complete after 1s [id=ocid1.exportset.oc1.phx.aaaaaaa]
data.oci_file_storage_export_sets.export_sets: Reading...
data.oci_file_storage_export_sets.export_sets: Read complete after 0s [id=2020-09-02 11:02:11.317584 +0000 UTC]
module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0]: Creating...
module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0]: Creation complete after 7s [id=ocid1.export.oc1.phx.aaazaaaaa]

Apply complete! Resources: 5 added, 0 changed, 0 destroyed.

Outputs:

fss_id = {
  "phxl1-filesystem-dbbackend-001" = "ocid1.filesystem.oc1.phx.aaaaaaaa"
}
mount_targets_id = {
  "phxl1-mount_target-control-001" = "ocid1.mounttarget.oc1.phx.aaaaabaa"
  "phxl1-mount_target-data-001" = "ocid1.mounttarget.oc1.phx.aaaaaaaaaa"
}

************************************************************************************
Resource created successfully, once again we perform apply it will prompt to create again.

______________________________________________________________________________________

kumvinov-mac:tf_tee_storage-tf-0.13.0 kumvinov$ terraform apply -var-file="phx_l.tfvars"
module.ads.data.oci_identity_availability_domains.ads: Refreshing state... [id=2020-09-02 11:01:22.358135 +0000 UTC]
module.compartments.data.oci_identity_compartments.compartments: Refreshing state... [id=2020-09-02 11:01:22.389357 +0000 UTC]
module.compartments_environment.data.oci_identity_compartments.compartments: Refreshing state... [id=2020-09-02 11:01:23.023335 +0000 UTC]
module.compartments_network.data.oci_identity_compartments.compartments: Refreshing state... [id=2020-09-02 11:01:22.980959 +0000 UTC]
module.vcns.data.oci_core_vcns.vcns: Refreshing state... [id=2020-09-02 11:01:24.735017 +0000 UTC]
module.fss["phxl1-filesystem-dbbackend-001"].oci_file_storage_file_system.fss[0]: Refreshing state... [id=ocid1.filesystem.oc1.phx.aaaaaaaa]
data.oci_file_storage_file_systems.fss: Refreshing state... [id=2020-09-02 11:01:34.804899 +0000 UTC]
module.subnets.data.oci_core_subnets.subnets: Refreshing state... [id=2020-09-02 11:01:25.605172 +0000 UTC]
module.nsgs.data.oci_core_network_security_groups.nsgs: Refreshing state... [id=2020-09-02 11:01:26.006074 +0000 UTC]
module.mount_target["phxl1-mount_target-data-001"].oci_file_storage_mount_target.mount_target[0]: Refreshing state... [id=ocid1.mounttarget.oc1.phx.aaaaaaa]
module.mount_target["phxl1-mount_target-control-001"].oci_file_storage_mount_target.mount_target[0]: Refreshing state... [id=ocid1.mounttarget.oc1.phx.aaaaaaa]
data.oci_file_storage_mount_targets.mount_targets: Refreshing state... [id=2020-09-02 11:02:10.191313 +0000 UTC]
module.export_set["phxl1-dbbackend-001"].oci_file_storage_export_set.export_set[0]: Refreshing state... [id=ocid1.exportset.oc1.phx.aaaaaaaa]
data.oci_file_storage_export_sets.export_sets: Refreshing state... [id=2020-09-02 11:02:11.317584 +0000 UTC]
module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0]: Refreshing state... [id=ocid1.export.oc1.phx.aaaaaby2aa]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.oci_file_storage_export_sets.export_sets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_export_sets" "export_sets"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaanbka"
      ~ export_sets         = [
          - {
              - availability_domain = "WrnJ:PHX-AD-1"
              - compartment_id      = "ocid1.compartment.oc1..aaaaaaaarmnbka"
              - display_name        = "phxl1-dbbackend-001"
              - id                  = "ocid1.exportset.oc1.phx.aaaaaa"
              - max_fs_stat_bytes   = ""
              - max_fs_stat_files   = ""
              - mount_target_id     = ""
              - state               = "ACTIVE"
              - time_created        = "2020-09-02 11:01:58.275 +0000 UTC"
              - vcn_id              = "ocid1.vcn.oc1.phx.ama47q"
            },
          - {
              - availability_domain = "WrnJ:PHX-AD-1"
              - compartment_id      = "ocid1.compartment.oc1..aaaaanbka"
              - display_name        = "phxl1-mount_target-data-001 - export set"
              - id                  = "ocid1.exportset.oc1.phx.aaaaaa"
              - max_fs_stat_bytes   = ""
              - max_fs_stat_files   = ""
              - mount_target_id     = ""
              - state               = "ACTIVE"
              - time_created        = "2020-09-02 11:01:32.761 +0000 UTC"
              - vcn_id              = "ocid1.vcn.oc1.phx.amaaaaxjl47q"
            },
        ] -> (known after apply)
      - id                  = "2020-09-02 11:02:29.274029 +0000 UTC" -> null
    }

  # data.oci_file_storage_file_systems.fss will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_file_systems" "fss"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaarbka"
        file_systems        = [
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaanbka"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "xxxxx@oracle.com"
                    "Oracle-Tags.CreatedOn" = "2020-09-02T11:01:32.467Z"
                }
                display_name        = "phxl1-filesystem-dbbackend-001"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                id                  = "ocid1.filesystem.oc1.phx.aaaaaaaa"
                kms_key_id          = ""
                metered_bytes       = "0"
                state               = "ACTIVE"
                time_created        = "2020-09-02 11:01:32.471 +0000 UTC"
            },
        ]
      ~ id                  = "2020-09-02 11:02:26.211523 +0000 UTC" -> "2020-09-02 11:02:31.884768 +0000 UTC"
    }

  # data.oci_file_storage_mount_targets.mount_targets will be read during apply
  # (config refers to values not yet known)
 <= data "oci_file_storage_mount_targets" "mount_targets"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaka"
      ~ id                  = "2020-09-02 11:02:28.59168 +0000 UTC" -> "2020-09-02 11:02:31.952888 +0000 UTC"
        mount_targets       = [
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaaaarla"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "xxxxxxar@oracle.com"
                    "Oracle-Tags.CreatedOn" = "2020-09-02T11:01:58.149Z"
                }
                display_name        = "phxl1-mount_target-control-001"
                export_set_id       = "ocid1.exportset.oc1.phx.aaaaa"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                hostname_label      = ""
                id                  = "ocid1.mounttarget.oc1.phx.aaaaaaa"
                ip_address          = ""
                lifecycle_details   = ""
                nsg_ids             = [
                    "ocid1.networksecuritygroup.oc1.phx.aaaaa",
                ]
                private_ip_ids      = [
                    "ocid1.privateip.oc1.phx.aaaaaca",
                ]
                state               = "ACTIVE"
                subnet_id           = "ocid1.subnet.oc1.phx.aaathtrksta"
                time_created        = "2020-09-02 11:01:58.275 +0000 UTC"
            },
            {
                availability_domain = "WrnJ:PHX-AD-1"
                compartment_id      = "ocid1.compartment.oc1..aaaaaaaarlka"
                defined_tags        = {
                    "Oracle-Tags.CreatedBy" = "xxxxx@oracle.com"
                    "Oracle-Tags.CreatedOn" = "2020-09-02T11:01:32.705Z"
                }
                display_name        = "phxl1-mount_target-data-001"
                export_set_id       = "ocid1.exportset.oc1.phx.aaa"
                freeform_tags       = {
                    "Environment"     = "Lab"
                    "Purpose"         = "Terraform"
                    "Region_function" = "Primary"
                }
                hostname_label      = ""
                id                  = "ocid1.mounttarget.oc1.phx.aaaaaa"
                ip_address          = ""
                lifecycle_details   = ""
                nsg_ids             = [
                    "ocid1.networksecuritygroup.oc1.phx.aaaxa",
                ]
                private_ip_ids      = [
                    "ocid1.privateip.oc1.phx.aaaaaacq",
                ]
                state               = "ACTIVE"
                subnet_id           = "ocid1.subnet.oc1.phx.aaaaa2gq"
                time_created        = "2020-09-02 11:01:32.761 +0000 UTC"
            },
        ]
    }

  # module.export["phxl1-dbbackend-001"].oci_file_storage_export.export[0] must be replaced
-/+ resource "oci_file_storage_export" "export" {
      ~ export_set_id  = "ocid1.exportset.oc1.phx.aaaaabaaaaa" -> (known after apply) # forces replacement
        file_system_id = "ocid1.filesystem.oc1.phx.aaaaaaaaaaaaa"
      ~ id             = "ocid1.export.oc1.phx.aaaaabaaaaa" -> (known after apply)
        path           = "/phxl1-dbbackend-001"
      ~ state          = "ACTIVE" -> (known after apply)
      ~ time_created   = "2020-09-02 11:02:12.801 +0000 UTC" -> (known after apply)

        export_options {
            access                         = "READ_WRITE"
            anonymous_gid                  = "65534"
            anonymous_uid                  = "65534"
            identity_squash                = "NONE"
            require_privileged_source_port = false
            source                         = "10.152.104.0/24"
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value:


$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$$
Point for this issue is still id getting new value after apply.

<= data "oci_file_storage_mount_targets" "mount_targets"  {
        availability_domain = "WrnJ:PHX-AD-1"
        compartment_id      = "ocid1.compartment.oc1..aaaaaaaka"
      ~ id                  = "2020-09-02 11:02:28.59168 +0000 UTC" -> "2020-09-02 11:02:31.952888 +0000 UTC"


Thanks 